

# index_dic = {'bust': ['가슴+', '품'], 'shoulder': ['어깨+'], 'armhole': ['암홀+', '팔통+', '팔단면', '소매품'],
#                 'sleeve': ['소매+', '팔+', '전체팔길이'], 'sleevewidth': ['소매+', '팔둘레', '팔뚝단면', '팔단면'], 'length': ['총', '전체길이','기장', '총길이', '총장'],
#                 'waist': ['허리'], 'hip': ['엉덩이', '힙'], 'hem': ['밑단', '치마밑단', '바지밑단', '끝단'], 'crotch_rise': ['밑위'],
#                 'thigh': ['허벅지']}

                
# index_dict = {   'length': ['전체','기장', '총길이', '총장', '총기장'], 'bust': ['가슴', '품'],  'shoulder': ['어깨'], 'armhole': ['암홀', '팔통', '팔단면', '소매품'],
#                 'waist': ['허리'], 'hip': ['엉덩이', '힙'], 'hem': ['밑단', '치마밑단', '바지밑단', '끝단', '밑폭', '발목'], 'crotch_rise': ['밑위'],
#                 'sleeve': ['소매', '팔', '팔길이'], 'sleevewidth': ['소매', '팔둘레', '팔뚝단면', '팔단면'], 
#                 'thigh': ['허벅지']}

index_dict = { 'length': ['총길이', '총장', '총기장'], 'bust': ['가슴', '품'],  'shoulder': ['어깨'], 'armhole': ['암홀', '팔통'],
                 'waist': ['허리'], 'hip': ['엉덩이', '힙'], 'hem': ['밑단', '끝단', '밑폭', '발목'], 'crotch_rise': ['밑위'],
                'sleeve': ['소매', '팔', '팔길이'], 'sleevewidth': ['소매', '팔둘레', '팔뚝단면', '팔단면'], 
                 'thigh': ['허벅지']}
